In [1]:
import seaborn as sns

In [7]:
df = sns.load_dataset('tips')

In [4]:
from sklearn.preprocessing import OneHotEncoder

In [5]:
encoder = OneHotEncoder()

In [8]:
encoded = encoder.fit_transform(df[['sex']]).toarray()

In [12]:
import pandas as pd
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out())

In [13]:
encoded_df

     sex_Female  sex_Male
0           1.0       0.0
1           0.0       1.0
2           0.0       1.0
3           0.0       1.0
4           1.0       0.0
..          ...       ...
239         0.0       1.0
240         1.0       0.0
241         0.0       1.0
242         0.0       1.0
243         1.0       0.0

[244 rows x 2 columns]

In [19]:
pd.concat([encoded_df,df], axis=1)

     sex_Female  sex_Male  total_bill   tip     sex smoker   day    time  size
0           1.0       0.0       16.99  1.01  Female     No   Sun  Dinner     2
1           0.0       1.0       10.34  1.66    Male     No   Sun  Dinner     3
2           0.0       1.0       21.01  3.50    Male     No   Sun  Dinner     3
3           0.0       1.0       23.68  3.31    Male     No   Sun  Dinner     2
4           1.0       0.0       24.59  3.61  Female     No   Sun  Dinner     4
..          ...       ...         ...   ...     ...    ...   ...     ...   ...
239         0.0       1.0       29.03  5.92    Male     No   Sat  Dinner     3
240         1.0       0.0       27.18  2.00  Female    Yes   Sat  Dinner     2
241         0.0       1.0       22.67  2.00    Male    Yes   Sat  Dinner     2
242         0.0       1.0       17.82  1.75    Male     No   Sat  Dinner     2
243         1.0       0.0       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 9 columns]